# HostParameterRangeError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PointFailures..::..HostParameterRangeError Property
BuiltInFailures..::..PointFailures Class See Also
---
Hosted Parameter must be between 0 and 1
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HostParameterRangeError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostParameterRangeError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HostParameterRangeError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PointFailures Class
Autodesk.Revit.DB Namespace